brew "gcc"
brew "llvm"
brew "cmake"
brew "python"

brew "git"
brew "gh"
brew "vim"
brew "neovim"
brew "tmux"
brew "bash"
brew "zsh"

cask "kitty"
cask "zen"
cask "spotify"
cask "discord"

cask "font-0xproto-nerd-font"

# stuff i want to add
# cask "nikitabobko/tap/aerospace"
# janky borders
# sketchy bar
